_posts/programming/2022-10-18-cppcoreguidelines-c49.html
---
layout: post
title: CppCoreGuidelines C.49 在构造函数中进行初始化操作，不要进行赋值操作
categories: [programming]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
C.49: Prefer initialization to assignment in constructors
</p>


<p>
<b>理由</b>
</p>

<p>
所谓初始化，就是要设置初始值，而不是进行赋值。初始化操作更优雅，效率更高。可以防止值确定之前被误用之类的错误。
</p>


<p>
<b>例子</b>
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">A</span> <span style="color: #707183;">{</span>   <span style="color: #3F7F5F;">// Good</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000; font-style: italic;">s1</span>;
  <span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">A</span><span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">czstring</span> <span style="color: #000000;">p</span><span style="color: #7388d6;">)</span> : <span style="color: #110099; font-style: italic;">s1</span><span style="color: #7388d6;">{</span>p<span style="color: #7388d6;">}</span> <span style="color: #7388d6;">{</span> <span style="color: #7388d6;">}</span>
    <span style="color: #3F7F5F;">// GOOD: directly construct (and the C-string is explicitly named)</span>
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #707183;">}</span>;
</pre>
</div>


<p>
<b>例子</b>
</p>

<div class="org-src-container">
<pre class="src src-bad src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">B</span> <span style="color: #707183;">{</span>   <span style="color: #3F7F5F;">// BAD</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000; font-style: italic;">s1</span>;
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">B</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #7F0055; font-weight: bold;">char</span><span style="color: #7F0055; font-weight: bold;">*</span> <span style="color: #000000;">p</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span> <span style="color: #000000;">s1</span> <span style="color: #7F0055; font-weight: bold;">=</span> p; <span style="color: #7388d6;">}</span>
    <span style="color: #3F7F5F;">// BAD: default constructor followed by assignment</span>
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #707183;">}</span>;

<span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">C</span> <span style="color: #707183;">{</span>   <span style="color: #3F7F5F;">// UGLY, aka very bad</span>
    <span style="color: #7F0055; font-weight: bold;">int</span><span style="color: #7F0055; font-weight: bold;">*</span> <span style="color: #000000; font-style: italic;">p</span>;
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">C</span><span style="color: #7388d6;">()</span> <span style="color: #7388d6;">{</span> cout <span style="color: #7F0055; font-weight: bold;">&lt;&lt;</span> <span style="color: #7F0055; font-weight: bold;">*</span>p; <span style="color: #000000;">p</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #7F0055; font-weight: bold;">new</span> <span style="color: #7F0055; font-weight: bold;">int</span><span style="color: #909183;">{</span><span style="color: #110099;">10</span><span style="color: #909183;">}</span>; <span style="color: #7388d6;">}</span>   <span style="color: #3F7F5F;">// accidental use before initialized</span>
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #707183;">}</span>;
</pre>
</div>

<p>
<b>例子</b>
</p>

<p>
这里我们不用<code>const char* s</code>我们用C++17中的<code>std::string_view</code>或
<code>gsl::span&lt;char&gt;</code> 做函数的参数。
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">D</span> <span style="color: #707183;">{</span>   <span style="color: #3F7F5F;">// Good</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000; font-style: italic;">s1</span>;
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">D</span><span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string_view</span> <span style="color: #000000;">v</span><span style="color: #7388d6;">)</span> : <span style="color: #110099; font-style: italic;">s1</span><span style="color: #7388d6;">{</span>v<span style="color: #7388d6;">}</span> <span style="color: #7388d6;">{</span> <span style="color: #7388d6;">}</span>    <span style="color: #3F7F5F;">// GOOD: directly construct</span>
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #707183;">}</span>;
</pre>
</div>
